#! /usr/lib/python3
# -*- coding: utf-8 -*-
dic_num={'0': '零',
 '1': '壹',
 '2': '贰',
 '3': '叁',
 '4': '肆',
 '5': '伍',
 '6': '陆',
 '7': '柒',
 '8': '捌',
 '9': '玖'}
MAPPING=('一', '二', '三', '四', '五', '六', '七', '八', '九','十')
dict_num={0:'',
 1: '一',
 2: '二',
 3: '三',
 4: '四',
 5: '五',
 6: '六',
 7: '七',
 8: '八',
 9: '九',
 10: '十'}


In[138]: num=[]
In[139]: for i in range(1,28):
...     if i<11:
...         num.append(dict_num[i])
...     elif i>10 and i<20:
...         num.append('十'+dict_num[i%10])
...     elif i>19:
...         num.append('二十'+dict_num[i%20])

dict_num={0:'',
 1: '',
 2: '二',
 3: '三',
 4: '四',yi
 5: '五',
 6: '六',
 7: '七',
 8: '八',
 9: '九',
 10: '十'}

['','Ⅰ', 'Ⅱ', 'Ⅲ', 'Ⅳ', 'Ⅴ', 'Ⅵ', 'Ⅶ', 'Ⅷ', 'Ⅸ', 'Ⅹ']
dict_num=dict(zip(range(0,11),['0','Ⅰ', 'Ⅱ', 'Ⅲ', 'Ⅳ', 'Ⅴ', 'Ⅵ', 'Ⅶ', 'Ⅷ', 'Ⅸ', 'Ⅹ']))
num=[]
for i in range(1,28):
    if i<11:
        num.append(dict_num[i])
    elif i>10 and i<20:
        num.append('Ⅹ'+dict_num[i%10])
    elif i>19:
        num.append('ⅩⅩ'+dict_num[i%20])

['一',
 '二',
 '三',
 '四',
 '五',
 '六',
 '七',
 '八',
 '九',
 '十',
 '十一',
 '十二',
 '十三',
 '十四',
 '十五',
 '十六',
 '十七',
 '十八',
 '十九',
 '二十',
 '二十一',
 '二十二',
 '二十三',
 '二十四',
 '二十五',
 '二十六',
 '二十七']

['Ⅰ',
 'Ⅱ',
 'Ⅲ',
 'Ⅳ',
 'Ⅴ',
 'Ⅵ',
 'Ⅶ',
 'Ⅷ',
 'Ⅸ',
 'Ⅹ',
 'ⅩⅠ',
 'ⅩⅡ',
 'ⅩⅢ',
 'ⅩⅣ',
 'ⅩⅤ',
 'ⅩⅥ',
 'ⅩⅦ',
 'ⅩⅧ',
 'ⅩⅨ',
 'ⅩⅩ',
 'ⅩⅩⅠ',
 'ⅩⅩⅡ',
 'ⅩⅩⅢ',
 'ⅩⅩⅣ',
 'ⅩⅩⅤ',
 'ⅩⅩⅥ',
 'ⅩⅩⅦ']
def main():
    pass


if __name__ == "__main__":
    main()