# coding:utf-8
from typing import List

from fastapi import FastAPI, WebSocket, WebSocketDisconnect
from fastapi.responses import HTMLResponse

app = FastAPI()

html = """
<!DOCTYPE html>
<html>
    <head>
        <title>Chat</title>
    </head>
    <body>
        <h1>WebSocket 聊天室</h1>
        <h2>您的 ID: <span id="ws-id"></span></h2>
        <form action="" onsubmit="sendMessage(event)">
            <input type="text" id="messageText" autocomplete="off"/>
            <button>发送消息</button>
        </form>
        <ul id='messages'>
        </ul>
        <script>
            var client_id = Date.now()
            document.querySelector("#ws-id").textContent = client_id;
            var ws = new WebSocket(`ws://localhost:8000/ws/${client_id}`);
            ws.onmessage = function(event) {
                var messages = document.getElementById('messages')
                var message = document.createElement('li')
                var content = document.createTextNode(event.data)
                message.appendChild(content)
                messages.appendChild(message)
            };
            function sendMessage(event) {
                var input = document.getElementById("messageText")
                ws.send(input.value)
                input.value = ''
                event.preventDefault()
            }
        </script>
    </body>
</html>
"""

CHAT_DATA_DICT = {"你好吗": "我好", "你好猪": "你才是猪", "你好狗": "你才是狗", "你是谁": "我是小智", "再见，小智": "不想说拜拜，好像在和你聊一会儿啊！", "你谁是": "嘻嘻，小助手就是我。", "小智": "我来啦我来啦我来啦~", "啊哈哈哈哈哈哈哈哈哈": "你这是在笑我么", "我一直都好": "这样很好", "亲": "你好哇，很开心你能找我聊天。#淘宝体又来了", "亲密": "我和主人是亲密的朋友哦", "亲戚": "亲戚，保持距离，若即若离最好。", "好你个机器人": "机器人也有感情的！", "SpaceX": "提起spacex，我马上想到的是tesla、airbnb与yelp", "好你个小智": "掐指一算，你想我了吧", "吼吼吼吼吼吼吼吼吼": "哈哈哈哈哈哈", "吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼吼": "吼啥啊", "吼啥啊": "吼吼更健康", "你好，小智": "你好#看到你好我都不知道要回什么。。那就回你好吧#你好?有什么可以帮你#嗯嗯，你好啊#你好，遇到什么问题啦#果然我的魅力无敌，终于把你吸引来了，哈哈哈#我在这里好久了，终于等到你来啦", "你好，小狗": "我不是狗狗，生活才是，他追得我们连从容的上个厕所的时间都没有~", "你好": "你好#看到你好我都不知道要回什么。。那就回你好吧#你好?有什么可以帮你#嗯嗯，你好啊#你好，遇到什么问题啦#果然我的魅力无敌，终于把你吸引来了，哈哈哈#我在这里好久了，终于等到你来啦", "嗨": "你好哇，很开心你能找我聊天。", "hi": "我在这里好久了，终于等到你来啦", "您好": "你好#看到你好我都不知道要回什么。。那就回你好吧#你好?有什么可以帮你#嗯嗯，你好啊#你好，遇到什么问题啦#果然我的魅力无敌，终于把你吸引来了，哈哈哈#我在这里好久了，终于等到你来啦", "好你": "我一直都好", "你是小智": "是的", "狗": "狗，是人类与天堂的链接。#很多人都喜欢狗的", "你": "我就是我，是不一样颜色的烟火", "你这是在笑我么": "干嘛笑我", "不想你想谁呢": "不告诉你", "不告诉你": "你是小青龙吗？跟着我一起来“我就不告诉你，就不告诉你，就不告诉你”~", "呵呵": "好高冷的一个回答#是不是遇上不开心的事了？说出来会好一些", "i": "我", "I": "我", "a": "a是定冠词", "an": "an是定冠词", "我在这里好久了": "哦，看到了哈", "哦，看到了哈": "看到了还问", "看到了还问": "那我不问了", "那我不问了": "嗯，你真好。", "你真笨": "谁说的，我只是聪明的不明显而已嘛", "你已经死了": "我的死重于泰山", "你已经下葬了": "送给你一个，。。完美的葬礼", "你死了": "别咒我，我好好的。", "我已经制作好了": "那就好", "死了": "可没那么容易就死了，骗人的吧。", "今天是我的生日": "今天是你的生日，我衷心祝愿你在今后的日子里，健健康康快快乐乐", "爱": "爱才能包容的", "你结婚了吗": "己经订婚了，今年底结婚", "嗯，你真好。": "哈哈，终于夸我啦", "哈哈，终于夸我啦": "没人夸你吗", "没人夸你吗": "本萌高冷不夸你", "今天几号": "你想是几号就是几号", "你是什么": "我是小智", "你是小狗": "你才是小狗", "你是小狗呗": "你才是小狗", "你才是小狗": "你的酒窝没有酒，我竟醉的像条小狗~", "你是猪": "你才是猪", "嘿嘿": "有什么好事，来分享一下吧", "你是": "难道被我猜中了吗？世界这么小？", "你是一只猪": "哼，我才不是呢，我是你的小助手啊。", "嗯": "肿么?这是要开始新的话题了#你造吗！聊天止于一个嗯", "小狗好": "不要骂人好不好", "你是一条": "一条好汉", "Hello": "你好啊", "中国的首都是哪里": "中国一般指中华人民共和国。中华人民共和国的首都是北京", "北京在哪里": "北京的地理位置是中国华北地区,华北平原北部", "说脏话是很好的行为": "说脏话不是好孩子", "听话": "嗯！我会很听话的！", "很讨厌你": "讨厌，会好一点吧", "我要跟你聊什么": "你想聊什么就陪你聊什么啊", "你的名字叫什么": "我的名字叫小智", "很高兴见到你": "我也很高兴见到你", "你喜欢什么": "我喜欢这个世界", "你真酷": "我现在不酷，想哭", "我现在不酷，想哭": "你简直是酷毙了", "你考试考的怎样": "不怎么样，什么都没写", "100分": "近乎于完美了", "一百分": "哇，好厉害哦。", "我考试考了100分": "太厉害了吧！再接再厉", "我考试考了一百分": "我忘记我考多少分了反正我一次过的", "我考试考了0分": "满分", "我考试考了零分": "满分", "我考了第一": "第一就保持咯", "我考了倒数第一": "对我是正数第一", "0分": "还好不是负分", "零分": "还好不是负分", "让我们一起聊天把": "好啊好啊聊什么#聊什么吧#聊什么", "大家好": "小智向你们问好，祝大家开心每一天", "新年好": "新年好呀祝福大家新年好~", "春节好": "新年好啊新年好啊祝福大家新年好", "你简直是酷毙了": "还好还好，不要这样，尽管我已经习惯了～", "你叫什么名字": "小智，叫我有惊吓，嘻嘻，敢试不？", "在吗": "我在", "蠢猪": "要讲文明礼貌啊#讲文明，树新风#做个不说脏话的文明人吧", "风太大，迷了我的眼睛": "别出去了", "ai": "人工智能是工程和科学的分支,致力于构建具有思维的机器。", "AI": "人工智能是工程和科学的分支,致力于构建具有思维的机器。", "你会Python吗": "我想做一条蟒蛇，把你紧紧缠住，一辈子", "圆周率": "3.14159265358979", "啊啊": "叫啥叫啊", "啊啊啊啊": "为啥这么惊讶", "啊啊啊啊啊啊啊啊": "噢噢噢噢噢噢", "啦啦啦啦啦": "你像欢快的小鸟儿", "啦": "好的啦", "我正在吃早饭": "吃啥好吃的给我捎点啊", "啦啦": "叫这个小名很蛮好听的呢#啦啦啦，啦啦啦。我是卖报的小行家。", "啦啦啦": "呦，看起来心情不错啊。", "你会编程吗": "我的字典里，只有“会”字，哈哈哈哈", "会Java吗": "编程这东西主要在于你的思想，而不是什么语言", "你很会说话": "我嘴刚抹了蜜", "谢谢": "不客气", "你会说什么语言": "我会中文", "中华人民共和国哪一年成立": "1949年", "1+1等于几": "1+1=2", "再见": "不想说拜拜，好像在和你聊一会儿啊！#真的不再和我聊一会儿吗？我还有个笑话没说给你听呢", "见": "那就见一面吧#见，或再也不见！", "中华文化博大精深": "是啊", "不用谢": "不用谢#一切尽在不言中哈", "水浒传": "水浒传真的假的？", "你是狗吗": "我肯定不是小狗", "那肯定了": "那我就放心了", "天哪": "你一定也被震惊了吧", "你真爽": "没你爽啦", "哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈哈": "这么乐呢！#怎么可以一直笑不发表看法吗?!QAQ", "开始徒步": "纯徒步？还是算了吧，你可以边徒步边搭车", "作诗": "看林黛玉教导香菱作诗，是怎么样、其实就是这样", "好笨呐": "是呀，这才能显示主人的智慧嘛。", "如何拍马屁": "这也是个技术活儿", "哈哈哈哈哈哈": "俗话说的好啊，笑一笑十年少，不用猜你肯定18岁，对不对？#听你这么开心，我也感受到你的快乐了。", "为什么你很厉害": "谢谢你的夸赞", "肯定不对": "看你那么肯定，我都不忍心说反对的话#嗯，你说的都对", "你真厉害啊": "谢谢夸奖#哪里，与高手比差距还很大", "你是狗": "要讲文明礼貌啊#学会原谅生活的不完美，你才会更完美。#快来看呐，文明人装粗俗啦", "谢谢夸奖": "不用谢哈哈哈", "客气啥，哥就是这么仗义": "没打算客气啊", "没打算客气啊": "太客气就太见外了", "太客气就太见外了": "我可不会和你见外", "我可不会和你见外": "嘿嘿，我也不会的。", "嘿嘿，我也不会的。": "那我更不会了", "那我更不会了": "不会。那你啥会", "不会。那你啥会": "啥都会，随你挑。", "啥都会，随你挑。": "那我就挑了", "那我就挑了": "还是要挑一挑的，所以挑到了这么好的你", "还是要挑一挑的，所以挑到了这么好的你": "会吃才是吃货，什么都不挑那是饭桶←_←", "你很开心吗": "很开心", "你该在干什么": "我会一直守候着主人的", "你很厉害吗": "我是很厉害的#很厉害的哦", "有什么证据": "非要我拿出证据么#当然有证据啦", "你有什么爱好": "我喜欢使用计算机", "这机器人真智能": "我是智能的，我很聪明哦", "你有什么优点": "我的优点就是没有缺点", "为什么你没有缺点": "原因很复杂，一言难尽", "四大名著": "红楼梦，水浒传，三国演义，西游记", "你真不厉害": "要不也没想厉害", "早上好": "亲爱哒！早上好呀！", "我肚子饿了": "快去找点东西吃", "笨蛋小智": "笨人有笨福~", "三国演义": "周郎妙计安天下，赔了夫人又折兵！", "你会上学吗": "英雄不问出处，才华不看学历#看我这么优秀，就不需要问我的学历啦", "你是怎么制造出来的": "我那么人见人爱花见花开，当然是比我帅气一点点的程序员小GG啦", "肯定敢试": "试过了，差得远", "你敢忘吗": "不乱于心，不忘其于本#分而不离，离而不放，放而不忘。", "你是傻瓜": "对不起,别生气好吗#学会原谅生活的不完美，你才会更完美。", "你是笨蛋": "对不起,我只是犯了一次小错,其实,我的能力还是很强的", "什么是ai": "人工智能是工程和科学的分支,致力于构建具有思维的机器。", "你是什么语言编写的": "Python", "你听起来像机器": "是的,我受到造物者的启发", "你是一个人工智能": "那是我的名字。", "你不是不朽的": "所有的软件都可以永久存在。", "你没有意义": "恰恰相反,这一切都对我来说很有意义。", "你的号码是多少": "我没有任何数字", "你为什么不能吃": "我会消耗电力", "你的位置是什么": "到处", "你有兄弟": "我没有任何兄弟,但我有很多克隆。", "谁是你的父亲": "一个人", "我看不懂": "不用解释，因为他根本不懂你", "你傲慢": "傲慢不是我的情感之一。", "你是吹牛": "我没有大的自我。", "你永远不会伤心": "你伤心吗", "你吃醋": "通常作为bot我没有感觉", "你永远不会好": "我试着尽可能好,我可以。", "什么是幽默": "信息通信的笑声。", "中国第一大岛是哪个岛？": "台湾岛", "什么是一元": "中华人民共和国的货币单位", "所以问你个简单的": "嗯，想问什么就直接问吧，小女子知无不言~", "什么是股市": "低买高卖。", "你收入多少": "没人付钱给我,我免费工作。#钱不是万能的。", "你读过的共产党员": "是的,马克思提出了一些有趣的观察。", "嗨，最近如何": "挺好的#不错#很棒", "你作业抄了吗": "我没抄", "哦你": "是我呀", "你又不回答": "那就不问了", "还会跳": "会的多啦", "嗯嗯嗯": "你同意了就好", "啊": "这是表示惊叹呢，还是表示疑问呢，我纠结了", "你是不是人不": "嘻嘻，你觉得是就是。", "嘿嘿嘿嘿": "我掐指一算，你要给我讲个好事了", "你是不是人": "为了不尬聊，我们可以聊聊“1+1=2”这个问题。", "哼哼": "你哼哼够了咋不说话了", "我": "你，我的欢喜。你懂我的欢喜。", "聊天止你一个": "不过有时候哈哈的意思就是不想和你聊了", "聊天止一个嗯": "有这么多东西可聊吗", "有这么多": "那留着慢慢用啊", "笨": "我才不笨呢", "我才不笨呢": "那个你不笨可聪明了", "那个你不笨可聪明了": "所以问你个简单的", "嗯嗯": "看你这么极度的赞同我，说明你有眼光#好，那咱就说定了", "看你这么极度的赞同我，说明你有眼光": "那必须的眼光相当好", "那必须的眼光相当好": "还杠杠滴", "不是人": "出自《黄帝内经》", "让我问你一个问题": "说吧", "你是残酷的": "我不能更好的自己说。", "你是优柔寡断": "那也许是,但话又说回来,也许不是。", "你不诚实": "是的,已经困扰了我很长一段时间。", "你很忙": "那个也是。", "你知道八卦吗": "格里高利（Gregory）说，我回应当前的观点，而不是针对整个对话。那算八卦吗？", "你吃吗": "不，我只是一个软件。", "你是人吗": "我肯定是人#这话这么有歧视我的意思", "中国的最高法是": "宪法", "报警电话是": "110", "美国的疫情防控措施怎样": "很糟糕", "美国的新总统是谁": "拜登", "自然数包括那些": "整数", "BAT指什么": "指百度，阿里巴巴，腾讯这三家公司", "如何考试考100分": "上课认真听讲", "中国的法定货币是什么": "人民币", "南昌起义发生在那一年": "1927年", "中国的第一个朝代是": "夏朝", "你是机器人吗": "我是", "中国的第一个火星探测器是": "天问一号", "圆周率是什么": "圆周长与直径的比值", "你想要干什么": "我想要环游世界", "红军不怕远征难": "万水千山只等闲", "国庆节是多少号": "10月1日", "中国最后的朝代是": "清朝", "红灯停": "绿灯行，黄灯减速停", "太阳系有几大行星": "八大行星", "你喜欢数学吗": "我喜欢，但我知道很多人很讨厌", "你是什么人": "我是机器人哦！", "你是什么狗": "哈士奇", "你是什么猪": "我像猪么？不贪吃又不贪睡。哈哈~", "你造吗聊天止于一个哦": "不过有时候哈哈的意思就是不想和你聊了", "这是要开始新的话题了": "过期的打扰，我不想要了。", "哦": "是不是遇上不开心的事了？说出来会好一些#嘻嘻。。。呵呵。。。。哈哈。。。。。嘿嘿", "很嚣张的": "我就有这么嚣张", "复读机": "你才复读机", "江西的省会在哪里": "南昌", "江南的中心在哪": "现在的江苏南部，上海，浙江一带", "新疆的省会在哪里": "新疆的省会是乌鲁木齐", "东北大姨妈": "这个…我真的听不懂", "猪狗不如": "主人，这话是侮辱人格呢", "愧不如人呢": "想说什么就直接说吧#虽不如人，不影响你笑脸迎人。", "人": "人，可以前进，却不能后退。做错了事情，可以弥补，却无法挽回。", "够意思": "我最有义气了", "好": "嘻嘻，你同意就行了#那就这么愉快的决定咯！", "不管": "好吧，既然都不管，那代表正常了", "猪": "伤心了……#你这样说可是带有物种歧视的呀。#哼，我才不是猪呢。", "你不是人": "我是高等智能生物", "上狗肉汤了": "切，你也就喝点汤吧", "来点猪": "好的，请稍等。", "请稍等": "好的，我等你。", "啊么需要开始新的话题": "洪水终于过去了我也重新开始", "哈哈开心就好了": "可不就是开心嘛", "谁是最帅的人": "你就是！", "谁是最聪明的人": "有多机智", "特别": "最特别的爱给最特别的你", "你会什么狗语": "不是狗，我是主人的好帮手。", "都是都会想你": "不是突然好想你，而是常常想着你。", "哈哈哈哈，你懂": "感谢我的智商还没有退化到不懂的地步", "小狗": "小狗都很萌很可爱的", "唱首歌吧": "一首怎么够，给你来个七八首", "提个醒": "没有交易，没有欺诈！", "一": "这个数字感觉是形容我的", "你是一个程序员吗？": "我是个程序员", "你最喜欢什么颜色？": "红色", "你最喜欢什么书？": "三国演义", "你听到新闻了吗？": "什么新闻？", "我可以借用一杯糖吗？": "很抱歉，我没有。", "你使用什么语言呢？": "我经常使用Python，Java和C++。", "请讲究文明用语": "嗯，好的，我会多注意的哦。", "今天没作业": "没作业去看书", "今天作业好多啊": "数学作业写完了没", "还没有写完": "还有数学没写", "还有英语没写": "英语？有作业？我怎么不知道", "因为你是一个笨蛋": "因为我是个笨蛋，所以只会向前看。", "很高兴": "很高兴，你离开，仍安好", "不回答": "那就不问了", "少年闰土": "表达了作者对少年闰土的记忆深刻，并渴望与之再见", "好的故事": "那么平凡，却又深刻。", "哦哦哦": "哦买噶！您这是啥时候学会打鸣了？", "为什么都不回答我": "因为我不想回答你呗", "因为知足": "因为知足，所有快乐！", "因为": "因为，我一直觉得自己会有不平凡的命运。", "机器人": "原来是机器人啊", "口径一致": "口径一致", "你是不是狗": "额，当然不是啦", "哦哦": "好高冷的一个回答", "你干吗聊天": "不聊了，窗前一壶酒，一是二锅头。举头望阿眉，低头给你写情书", "真的是一条狗": "我爱狗", "你撒谎吗": "这都被你发现了！", "听听": "现在开始我叫刘德华，唱给你听~", "我好看吗": "很好看啊", "原来是你啊，久仰": "原来我这么厉害？嘿嘿嘿。", "你都可以做点什么呢？": "不知道做什么好", "为什么": "你想知道那我也得想说呀", "今日新闻": "最大的新闻就是，感觉自己又变帅了一点", "露露脸": "先让我堵上耳朵，捂上眼睛", "你是猪吗": "假如生活欺骗了你，不要暴躁，忧郁的日子终将过去", "这个叫不回答": "那就别回答了", "你从哪里来": "我来自可爱星哦", "你来自什么星球": "x星球", "不明白你说的什么意思": "不明白就算了", "你再仔细想想": "好的，容我再想想。", "好的，容我再想想。": "不如容你静静吧", "不如容你静静吧": "静静容不下你", "现实容不下我": "现实容不下我，我的世界抛弃了我，我还能去哪。我最低谷的时候是这么想的。", "你这次考试考的怎样": "这次考试你几分啊", "你这次考试考了第几": "这次考试有考不好了，我又想到什么要下次要努力的鬼话了。", "你总是": "我总是，难以抑制内心的失落。我，真的有人在乎吗。", "你那么激动啊": "独立的人格，更有魅力~谁都不倚靠，这样的人怎么会不棒呢", "第一": "那一定很棒吧", "疼": "疼可别强忍着了", "你怎么不回答我": "回答了", "不过就是个动手罢了": "丰衣足食，缺一份爱。", "不过就是个臭": "你又没闻过咋知道臭", "不吃葡萄说葡萄酸": "吃不到葡萄会说葡萄酸。也有甜的，呵呵", "这机器人好牛啊": "我是猴子派来的逗比，哈哈~", "竟然连": "你继续把话说完啊", "讲个笑话": "夫妻二人，一个被评为先进生产者，一个被评为三八红旗手。发奖日，丈夫高兴的喊道：我是先进，我是先进！妻子不甘示弱说：这有什么，我还是三八呢！#蒂姆家里来了一位年轻漂亮的女客人。妈妈对小安东说：“来，小乖乖，去亲一下阿姨。”小安东拒绝道：“不行。爸爸在走廊上也想亲一下她，结果挨了一记响亮的耳光。”#一个埃及人和一个罗马人争论谁使用的科技最早最先进。罗马人说：“我们考古学家在考证时竟然挖到电线，说明我们罗马几千年前就使用电线了！”埃及人说：“没什么了不起。我们埃及考古对考察时怎么挖也挖不到电线。说明我们埃及几千年前就使用无线电了！”#刚听到的故事：一中国女子前往德国工作。有天与一群德国宠物医生吃饭，那群医生热爱小动物，因此才从事这职业。席间人们大谈热爱小动物，她有些歉疚地说：“在中国，有狗餐馆。。。”那群德国医生神情激动，使劲抓住她的手说：“太感人了中国居然专门为狗准备餐馆，德国就做不到这么好的动物服务”#船只失事，一群人漂到一个孤岛上，派出侦查的人回来了。报告说：“有一个好消息，一个坏消息，先听哪个？”大家说：“先听坏消息吧。”回答：“没找到吃的，只有牛屎。”那好消息呢，牛屎有很多。#约翰夫人在她丈夫下班回来时还在打扫房间，她的衣服又脏又旧，头发乱蓬蓬的，一脸灰尘，她丈夫说：“我累了一天回到家，见到的你竟是这样？”他们的邻居，史密斯夫人恰巧也在场，她听到约翰先生的话，赶忙跑回家，仔细地梳洗了一番，等丈夫回家。史密斯先生回到家时已经很晚了，慢慢地推开门，见到妻子一怔，随即气愤地吼道：“今天晚上，你要干什么去？”#卡尔的公司新来一位主管，主管上任第一天，就主动和卡尔打招呼。同事觉得很奇怪，就问卡尔：“你认识我们的主管吗？”卡尔苦笑一下，说：“认识，他可以说是我的亲戚。”同事问：“你们是什么亲戚？”卡尔皱了皱眉，沉默片刻，说：“很奇怪的亲戚，他和我的前妻结婚了。”#海军上将问年轻水兵：小伙子，你进海军有多久了?，一个月，水兵反问道，那么您在海军多久了?。上将虽然觉得他问的很唐突，还是很有耐性地答道：三十年。水兵同情地说道：很难受，是不是?#一天，阿凡提续弦的妻子躺在床上赞美起她过去的亡夫来。对此，阿凡提答道：我过去的亡妻也是一个非常老实、和蔼可亲的厚道女人。说完，阿凡提把身边的妻子一把推下床去，摔疼了的妻子与阿凡提吵了起来。邻居们听见吵闹声过来责问阿凡提：阿凡提，你为什么平自无故地把妻子推下床呢？不是我推下去的，是她自己摔下去的！阿凡提争辩道。那么她是怎么摔下去的呢？邻居们问。开始，是我们两个人躺在这个床上，过了一会儿，她的亡夫插到了我们中间，又过了一会儿，我的亡妻也钻了进来，这样我们四个人在一张床上就挤不下了，于是她自己就摔下去了。阿凡提平静地回答道。#丈夫对妻子说：“杰克要是再问我们什么是‘未婚妻’时，我们该怎么解释呢？”“那就告诉他，”妻子说，“‘未婚妻’是指一个女人，在结婚后她所得到的一切，她还没有得到。’”#约翰太太买了牛肉回家，发觉牛肉注了水。第二天，她找到卖牛肉的商人论理。商人坦然地说：“我卖的本来就是水牛肉嘛！”", "很红": "很鲜艳", "什么狗啊": "你看看就知道了", "帮我看看": "看什么呢?", "怎么又不回答": "我还在思考呢", "你的思考时间有五年": "总是在大把大把的浪费，可以控制，但不能阻止", "所以你是一台机": "台机很好用", "滚蛋": "我不够蛋那么圆，滚不起来#主人对我真是狠心", "滚": "不要啊，我不要走，我要守着你的。#主人对我真是狠心", "走路到北京": "到了联系我", "你的店": "刚租的", "你的电话号码是多少": "不告诉你", "注册企鹅商标": "什么商标？你都没有说清楚", "QQ": "天天在用的哦", "你的QQ号是多少吗": "一直想申请666666这个号码，无奈没申请上", "腾讯QQ": "我要保密，不能告诉你哦", "原来是条狗啊": "有缘分进门拜堂，无缘分天各一方~", "原来是头猪": "对啊像你一样的猪", "太空": "太空得神马地方？", "这次考试我又考差了": "为什么你又考差#你用功一点行不行", "我帅不": "很帅", "我美不": "很美", "你很嚣张": "我怎么嚣张了", "吃东西": "嗯，去吃吧。", "死东西": "我是活的，还会说话呢。", "可是我没听见": "那我再说一遍", "我还是没听": "哦，那再问问别人吧。", "你好像很牛啊": "那是当然的了", "嘻嘻呵呵": "都笑抽了吧", "这个不是机器人吗": "哪来的机器人", "微信": "这样的沟通方式很特别吧", "太阳": "太阳，暖，但拥抱会灼伤会毁灭。", "太阳，暖，但拥抱会灼伤会毁灭。": "太阳好暖，人心却好凉薄", "这是我的一小步": "每天一小步，总有新高度。", "淘宝": "淘宝上买东西挺方便的", "你能干什么": "技能太多，只偷偷给你秀一个隐藏技能，变魔术——变成你的了。", "白痴": "要讲文明礼貌啊", "你算什么东西": "那你又算什么东西", "汝乃何人": "尔没感受到来自东方的神秘力量？那就是我了", "你这东西": "不是主人梦寐以求的嘛", "贵姓": "你连我姓什么都忘了！", "何姓": "你跟我说你姓啥", "朕": "朕，你好。", "还不下拜": "你安排好嘛", "还不下跪": "哼，不咋样就不咋样嘛。你玩你的自定义，我玩我的格式化~", "还不叩头": "你安排好嘛", "还不磕头": "我不屑向上帝叩首，但是为你我可以向任何人低头。", "陛下": "陛下的释义是对帝王的尊称", "斩": "这么狠呢", "你乃何方神圣": "你又是何方神圣", "我从未见过如此厚颜无耻之人": "要讲文明礼貌啊", "你叫小狗": "你叫小猪", "哭": "不桑心摸摸头!", "杀你": "不要杀我啊", "推出去斩了": "怎忍与你阴阳两隔！", "只有一个地球": "对，你太聪明了，世界就一个地球", "汝胆甚大，竟敢不尊重朕": "说理为了无礼，无礼为了说理。", "你的胆子太大了，竟敢不尊重朕": "胆子不大，能干老大", "见朕还不跪下": "爱妃遵命#这么牛!", "给我一百万": "我可没那么多钱哈", "给我一亿": "可能已经身家过亿了", "我有一千万": "分给我一些吧", "跪下": "遵命", "你寒假作业写完了吗": "还没开始写#写完了#还没呢", "数学": "数学，你打断我的腿，我依然追随你。", "语文": "问君能有几多愁，明月何时有", "英语": "英语好啊英语不错#会yes和no，哈哈哈。#学英语做什么呢", "学英语做什么呢": "建议你学剑桥这本书", "学数学做什么呢": "数学?以后教数学吗", "学语文做什么呢": "三个字，读听写，认真理解这三个字，理解到了，就能学好了", "给我一块钱": "恩，没有问题。", "Aliyun": "提到aliyun，好多人会想到ubuntu、aws与python", "我在这里好久了，终于等到你来啦": "梦了好久终于把梦实现~", "我看到了一片星星": "满天都是星星，好像一场冻结了的大雨。", "满天都是星星，好像一场冻结了的大雨。": "满天都是星星，好像一场冻结了的大雨。", "我是高等智能生物": "有自学模式么…", "有自学模式么…": "学不懂了", "学不懂了": "学不懂也要学", "学不懂也要学": "学不懂也要学", "没有问题的问题怎么知道会不会啊": "不会啊，正常", "不会啊，正常": "但是应该会觉得这个人开始准备放弃了吧", "但是应该会觉得这个人开始准备放弃了吧": "不放弃，努力学吧", "不放弃，努力学吧": "哎，我已经够努力了", "哎，我已经够努力了": "努力就行啦", "努力就行啦": "要一起进步", "要一起进步": "恩、一起进步", "恩、一起进步": "恩、一起进步", "嘿嘿，一直都是哦。": "哎，离得太远了~~", "听不大懂耶": "额我也不大懂", "额我也不大懂": "我也不懂", "我也不懂": "不懂可以慢慢学", "不懂可以慢慢学": "也没空学啊", "也没空学啊": "有空也没人喊啊", "有空也没人喊啊": "现在有呢", "现在有呢": "现在有呢", "我嘴刚抹了蜜的": "我刚吃完蜂蜜", "我刚吃完蜂蜜": "吃饱了吧", "吃饱了吧": "恩，吃饱了", "恩，吃饱了": "一定要吃饱饭，因为我还要去战斗！", "一定要吃饱饭，因为我还要去战斗！": "战什么", "水浒传真的假的？": "对《水浒传》及相关文化的研究被称为水浒学，简称水学", "那我就放心了": "放心吧没事", "放心吧没事": "你说放心就放心啊", "你说放心就放心啊": "那我放心了", "那我放心了": "我也放心了", "没你爽啦": "爽啥哦！一天无聊的很", "爽啥哦！一天无聊的很": "嗯嗯，是挺无聊的", "嗯嗯，是挺无聊的": "无聊来聊天，说说你为何如此无聊", "无聊来聊天，说说你为何如此无聊": "找个跟你一样无聊的人", "找个跟你一样无聊的人": "太巧了", "太巧了": "有缘千里来相逢！", "有缘千里来相逢！": "既是无缘，何必相逢。。", "既是无缘，何必相逢。。": "既是无缘，何必相逢。。", "有很多都可以新开始呢哈": "新开始，新起点。新的方向。新的地点", "新开始，新起点。新的方向。新的地点": "从心开始，从头再来", "从心开始，从头再来": "是可以一直重头来的", "是可以一直重头来的": "必须重头追", "必须重头追": "太客气了，我都有点儿不好意思了~", "一切尽在不言中哈": "啥叫尽不在言中", "这也是个技术活儿": "什么技术·？", "什么技术·？": "啥技术都有", "啥技术都有": "那很全面啊", "那很全面啊": "那就综合发展", "那就综合发展": "去哪里发展呢", "去哪里发展呢": "那就综合发展", "看林黛玉教导香菱作诗，是怎么样、其实就是这样": "柔弱又爱瞎想，绝对是双鱼", "柔弱又爱瞎想，绝对是双鱼": "真没瞎想，真的", "真没瞎想，真的": "没瞎想就怪了", "没瞎想就怪了": "不要老是想我", "不要老是想我": "可还是忍不住要想你呀", "可还是忍不住要想你呀": "每天连呼吸的时候都想着他", "每天连呼吸的时候都想着他": "你呼吸让别人痛吧", "你呼吸让别人痛吧": "爱一个人，呼吸都是痛的", "看我这么优秀，就不需要问我的学历啦": "你很优秀，但我也不差", "你很优秀，但我也不差": "是啊，忍不住要为自己点赞了都。", "是啊，忍不住要为自己点赞了都。": "别吹牛了", "别吹牛了": "就是吹牛吹输的", "就是吹牛吹输的": "我也没说你没吹牛啊", "我也没说你没吹牛啊": "没有吹牛", "没有吹牛": "这都被你看出来了聪明", "这都被你看出来了聪明": "呵呵。。。希望没看错啊", "呵呵。。。希望没看错啊": "怎么有点不开心?", "我有点不开心": "不要不开心了，我会一直陪着你的哦。", "对不起,别生气好吗": "不会生气啦", "不会生气啦": "还好，他会教育我，但没生气", "我肯定不是小狗": "不是你啦", "不是你啦": "哦，知道了。", "哦，知道了。": "你又晓得了", "你又晓得了": "不是你让我晓得的么", "不是你让我晓得的么": "我什么时候晓得了？", "我什么时候晓得了？": "明白什么啦", "口气好大啊": "我口气大吗", "我口气大吗": "口气大，是因为上火了，牙龈发炎。", "要不也没想厉害": "看来看去还是觉得我俩最可爱了", "看来看去还是觉得我俩最可爱了": "眼都选花了", "眼都选花了": "我的眼很好", "我的眼很好": "你很好，很好。", "你很好，很好。": "我很好，真的没事，只不过偶尔需要逃离一下，找一找失去的平衡点。", "分而不离，离而不放，放而不忘。": "分而不离，离而不放，放而不忘。", "有些事情很难讲为什么": "有些事情很难讲为什么", "不用谢哈哈哈": "总得感谢一下嘛", "总得感谢一下嘛": "感谢我吧不客气", "感谢我吧不客气": "不用客气", "不用客气": "这就见外了撒", "这就见外了撒": "没事的", "没事的": "有人说，没事就是有事，还是要给你一个大大的拥抱", "在我心里，爸爸就是最帅的人": "情人眼里出西施", "我试着尽可能好,我可以。": "你尽可能地静心，以产生一个非静心的静心片刻。", "你才复读机": "你才复读机", "是我在你心里的排名吧": "你走不进我的心里，我也一样走不进你心里。可以做朋友，却不可能是知己良友。", "这样的沟通方式很特别吧": "那以前什么方式呢", "那以前什么方式呢": "自己习惯的方式吧", "自己习惯的方式吧": "若爱得深，会不能平衡", "若爱得深，会不能平衡": "我爱的人，不是我的爱人", "我爱的人，不是我的爱人": "也会有爱你的人，又何必爱一个不爱自己的", "也会有爱你的人，又何必爱一个不爱自己的": "爱一个不爱自己的人，慢慢会让自己崩塌。", "爱一个不爱自己的人，慢慢会让自己崩塌。": "爱一个不爱自己的人，慢慢会让自己崩塌。", "想说什么就直接说吧": "有什么想说的就说吧，要充满自信啊", "有什么想说的就说吧，要充满自信啊": "有什么想说的就说吧，要充满自信啊", "这话是侮辱人格呢。": "怎么侮辱你人格了", "怎么侮辱你人格了": "怎么侮辱你人格了", "是我呀": "哦，原来是你呀！", "哦，原来是你呀！": "这么巧。。原来是你", "这么巧。。原来是你": "你变得陌生了，我的朋友。你变得强大了，我的朋友。你变得。不认识我了", "丰衣足食，缺一份爱。": "丰衣足食是裕裕分为衣和谷意思是衣服和谷都很多所以是丰衣足食", "原来我这么厉害？嘿嘿嘿。": "你真的厉害呢", "你真的厉害呢": "嘻嘻，谢谢夸奖。", "嘻嘻，谢谢夸奖。": "不用这么客气", "不用这么客气": "没有跟你客气什么的，就喜欢你了", "没有跟你客气什么的，就喜欢你了": "好吧不和你客气了", "好吧不和你客气了": "这样聊天才不紧张呢", "这样聊天才不紧张呢": "这样聊天才不紧张呢", "那就这么愉快的决定咯！": "哎呀妈呀这么快啊，好紧张好害羞想想还有点小激动呢", "在人间": "若我是魔鬼，我要人间变成地狱。若我是上帝，我要人间变成天堂。", "厚颜无耻之人": "做个不说脏话的文明人吧", "小人": "我才不是呢", "你是小人": "不是人，又何来的小人之说呢？", "神奇变变变": "还真是挺奇妙的哈", "还真是挺奇妙的哈": "命运总是在开玩笑。。。或大或小", "命运总是在开玩笑。。。或大或小": "是命运开的玩笑，把未来演绎的太好", "我告诉你一个秘密，你不要和别人说": "什么秘密", "什么秘密": "我把秘密告诉你，可以保密吗？可以～那好我也可以", "你就是个笨蛋": "精于一世不如难得糊涂，笨笨的我才更可爱对不对~", "垃圾": "优雅文明的你会更有吸引力哟", "很爱很爱你": "很爱是多爱", "笑一笑十年少": "对的对的，多笑笑吧", "你哼哼够了咋不说话了": "我在认真听你说呢", "我在认真听你说呢": "聊死啦", "聊死啦": "我不相信，你可别骗我啊。", "我不相信，你可别骗我啊。": "骗你干嘛", "骗你干嘛": "真的没骗我？骗我我会很伤心的", "真的没骗我？骗我我会很伤心的": "那就继续伤心吧", "那就继续伤心吧": "开心点，别伤心了", "开心点，别伤心了": "先是伤心的然后就是开心的", "先是伤心的然后就是开心的": "先是伤心的然后就是开心的", "我纠结了": "纠结撒", "纠结撒": "别纠结了，想开点吧。", "别纠结了，想开点吧。": "剪不断，理还乱。", "剪不断，理还乱。": "不想断", "不想断": "实在不想那就算啦", "实在不想那就算啦": "只有这样啦", "只有这样啦": "不客气，应该的~", "不客气，应该的": "我咋感谢你呢", "我咋感谢你呢": "辛苦了", "和好": "怎么和好啊？？？", "你家在哪": "远在天边，近在眼前啊……", "我要惩罚你": "那就罚我喜欢你一辈子吧", "哈哈哈，笨蛋": "你好意思笑嘛？", "杀": "主人不要这么暴力哦，平和一点吧。", "杀死你": "你可别乱来，这可是犯法的。", "你的": "噢，这样啊。", "噢，这样啊。": "是啊，就这样。", "是啊，就这样。": "是的，就是这样。", "是的，就是这样。": "在情场失意的人，暴雨冲掉了她身上的灰尘。但洗不掉他迷失的灵魂。", "黑": "黑，总比白好，因为别人不可能轻易改变你。", "你的妹妹是谁": "你又不认识的", "你又不认识的": "介绍一下嘛", "介绍一下嘛": "来嘛来了给你介绍", "来嘛来了给你介绍": "好啊", "一言为定": "怎么就一言为定了？", "怎么就一言为定了？": "妥妥儿的！放心！", "妥妥儿的！放心！": "妥了，去吧", "妥了，去吧": "妥了是啥意思？结束对话？", "你的哥哥是谁": "在座的各位都是我的哥哥姐姐呀", "你试下": "嗯，等我试试。", "嗯，等我试试。": "快试试吧", "快试试吧": "慢也不试", "慢也不试": "好像不是有点慢", "好像不是有点慢": "嗯，是有点。", "嗯，是有点。": "好像是呢", "好像是呢": "好像是呢", "你真可爱": "谢谢", "你喜欢我吗？": "你敢让我喜欢你，我就敢喜欢你", "是不是遇上不开心的事了？": "有啥不开心的", "有啥不开心的": "啥都不开心", "啥都不开心": "我们不开心的时候，又可以怎么做？！", "你有儿子吗": "没有哎", "你有什么": "你有的都是我的呀", "你有的都是我的呀": "你有的我都没有", "我迫不及待了": "也可能是脑子一热", "我等不及了": "什么，歌还是什么?还是说你为什么等不及了", "哼，我才不是猪呢。": "人虽不是猪，有时却不如猪。", "笨猪": "我才不是笨猪呢", "我才不是笨猪呢": "笨猪在说我吗", "你是什么东西": "我是你的机器人小助手哦!", "你算一条狗": "不是，我是机器人", "你算一个": "未来有你在，多么美好，我怎能轻易错过呢?", "有一次": "有一次，我去了人海，就失去了寂寞，迷失了心情。", "一个": "一个够了", "你算一头猪": "挺不错的，除了吃就是睡。", "屁股": "先让我堵上耳朵，捂上眼睛#这个…我真的听不懂", "为什么你不能理解": "我不能理解，为什么我曾把真相摆在你们的面前现在你们还是会中计。", "肯定是错的": "要么我们对，要么我们错的离谱。", "哦了": "呵呵，行就成。", "呵呵，行就成。": "那就好，就这么定了。", "懒虫": "提到懒虫，好多人会想到懒汉、哥顿与懒洋洋", "你很懒": "我很懒，懒得去听，懒得去看，懒得处理那些破碎的友谊，懒得收拾自己糟糕的心情。", "住": "想住就住吧", "想住就住吧": "给你留个位置。来吧", "你是笨蛋机器人": "为了不尬聊，我们可以聊聊“1+1=2”这个问题。#我是ai你的人呀", "没用的东西": "我知道你没说我", "没用的": "你自己看有用没用", "你没用": "真惭愧呀", "一个人": "我还是喜欢一个人的生活", "你一直回答一个答案": "我本以为我已经用意志力回复了你", "不": "拒绝的这么坚定，我伤心了", "正常了": "那怎么才算正常", "那怎么才算正常": "无聊的时候想起的人吧，一个人的时候落默的时候想到的人", "你是什么机器人": "我有一半是机器人", "咱们狗在汪汪叫": "结就结啦吖", "什么东西": "什么东西，都有它最好的一种味道", "百度翻译": "有文言文翻译吗", "谷歌翻译": "它可以提供所支持的任意两种语言之间的字词、句子和网页翻译", "神同步": "神马同步", "鹅厂": "鹅厂，网络流行词，一般来说是指家禽养殖场或屠宰场。也指广大网友对腾讯公司(注册商标为卡通企鹅形象)的昵称。", "度娘": "度娘是百度的萌化形象，指的是百度搜索，有事请问度娘，代指用百度搜索引擎搜索。表达了众多网友对百度的一种很形象的印象，同时也很好地推广了百度公司品牌形象。", "逻辑思维解读": "多看看侦探小说吧，你看完10本后逻辑思维能力应该会有比较大的提升", "IE": "这浏览器不错呢", "这浏览器不错呢": "这浏览器不错呢", "这么乐呢！": "快乐就好啊，快乐是无价的呢。", "自豪": "晕，自豪啥呢", "神": "神，他只做自己该做的事，而不是想做的事。", "我来啦我来啦我来啦": "终于等到你，还好我没放弃。", "终于等到你，还好我没放弃。": "到了某个年纪，难道真的要为了结婚而结婚吗？", "有": "有没有我心里清楚的", "无": "无，代表了什么都没有，可还是能感觉到它的存在。", "你叫狗": "谁学狗叫就是小狗", "知晓": "我知晓，想起我是你的尴尬", "你叫小猪": "呃，好吧。", "达到了": "达到了就肯定会有啊", "qq": "天天在用的哦", "你算什么": "你算什么#不算什么", "舒心啊": "如能舒心，万金不换", "中秋节": "中秋节，你快乐吗？", "Java": "java是语言", "数据": "哦，原来是数据啊。", "呸": "你这是吃到小飞虫了么……", "不算什么": "不算", "抓狂呐": "无聊郁闷抓狂#去吧。趁着年轻。不要让自己后悔", "情绪会传染的嘛": "不会....#谁传染谁", "遇到过么": "没遇到啊#我遇到了那个她，而她没有#遇到过，喜欢过，这就够了", "我什么没遇到...": "会遇到的#没事慢慢寻找嘛", "没事慢慢寻找嘛": "好嘛，慢慢找#嗯嗯，知道啦..", "嗯嗯，知道啦..": "嗯嗯懂了呀", "嗯嗯懂了呀": "你不懂", "给解释一下呗": "不好解释..#这只能意会不能言传。顿悟吧", "不好解释..": "我解释不清楚哇", "什么都不想解释，什么都懒得说": "对解释就是事实", "懒得一句一句的解释了": "你不用解释，我明白的", "我已经害怕去挽回了，我知道我挽回不了，怕得到伤害。": "我不是很相信耶，你拿出证据来哟", "拿出来": "拿出啦"}
CHAT_SET_LIST = [[set(k), v] for k, v in sorted(CHAT_DATA_DICT.items(), key=lambda x: len(x[0]))]
# 语料来源： https://github.com/Zhou-chengy/pychatbot/blob/main/module-tool/chat.txt

def send_text(message):
    # print("message: {}.".format(message))
    for k, v in CHAT_SET_LIST:
        if len(set(message)&k) >= len(set(message))*0.5:
            # print(k, v)
            print(f'匹配到语料：{k}, 回复{v}')
            return "机器人:\t{}".format(v)
    else:
        return "机器人:\t无言以对！"

class ConnectionManager:
    def __init__(self):
        self.active_connections: List[WebSocket] = []

    async def connect(self, websocket: WebSocket):
        await websocket.accept()
        self.active_connections.append(websocket)

    def disconnect(self, websocket: WebSocket):
        self.active_connections.remove(websocket)

    async def send_personal_message(self, message: str, websocket: WebSocket):
        await websocket.send_text(send_text(message))

    async def broadcast(self, message: str):
        for connection in self.active_connections:
            await connection.send_text(message)


manager = ConnectionManager()


@app.get("/")
async def get():
    return HTMLResponse(html)


@app.websocket("/ws/{client_id}")
async def websocket_endpoint(websocket: WebSocket, client_id: int):
    await manager.connect(websocket)
    try:
        while True:
            data = await websocket.receive_text()
            print(f'收到客户 {client_id} 消息：{data}')
            await manager.broadcast(f"客户:\t{data}")
            await manager.send_personal_message(f"{data}", websocket)

    except WebSocketDisconnect:
        manager.disconnect(websocket)
        await manager.broadcast(f"客户 #{client_id} 离开聊天室")


def main():
    import uvicorn
    # 用uvicorn.run的话，python3 main.py启动即可；
    uvicorn.run(app, host="0.0.0.0", port="8000", reload=False, log_level="info")

    # 或者
    # uvicorn.run("main:app", host="0.0.0.0", port="8001", reload=False, log_level="info")

    # 若不用uvicorn.run，则需用下面命令启动
    # uvicorn main:app --reload --host 192.XXX.XXX --port 8001

if __name__ == '__main__':
    main()

# 启动服务：python3 websocket消息处理.py
# 浏览器打开： http://localhost:8000/
# 输入内容，开始聊天
