#!/usr/bin/env python3
# -*- coding: utf-8 -*-

import time
import os
USERNAME = os.getenv("USERNAME")
# 模型来源：https://huggingface.co/IDEA-CCNL/Erlangshen-Ubert-110M-Chinese
model_dir = rf"D:\Users\{USERNAME}\data\Erlangshen-Ubert-110M-Chinese"

import argparse
from fengshen import UbertPipelines # https://github.com/IDEA-CCNL/Fengshenbang-LM/

total_parser = argparse.ArgumentParser("TASK NAME")
total_parser = UbertPipelines.pipelines_args(total_parser)
args = total_parser.parse_args()

args.pretrained_model_path = model_dir
args.default_root_dir = model_dir

test_data=[
    {
        "task_type": "抽取任务",
        "subtask_type": "实体识别",
        "text": "这也让很多业主据此认为，雅清苑是政府公务员挤对了国家的经适房政策。",
        "choices": [
            {"entity_type": "小区名字"},
            {"entity_type": "岗位职责"}
            ],
        "id": 0}
]

model = UbertPipelines(args)
result = model.predict(test_data, cuda=False)
for line in result:
    print(line)
# {'task_type': '抽取任务', 'subtask_type': '实体识别', 'text': '这也让很多业主据此认为，雅清苑是政府公务员挤对了国家的经适房政策。', 'choices': [{'entity_type': '小区名字', 'entity_list': [{'entity_name': '雅清苑', 'score': 0.9367574165087298}]}, {'entity_type': '岗位职责', 'entity_list': [{'entity_name': '公务员', 'score': 0.6243669833939821}]}], 'id': 0}

def ner(model, text="海南省长春市朝阳区西中华15号宜家公寓14楼1405室"):
    test_data = [
        {
            "task_type": "抽取任务",
            "subtask_type": "实体识别",
            "text": text,
            "choices": [
                {"entity_type": "小区名字"},
                {"entity_type": "公司"},
                {"entity_type": "政府机构"},
                {"entity_type": "组织机构"},
                {"entity_type": "旅游景点"},
                {"entity_type": "楼宇名称"},
                {"entity_type": "大厦名称"},
                {"entity_type": "企业名称"},
                {"entity_type": "公寓名称"},
                {"entity_type": "地标建筑"},
                {"entity_type": "公园广场"},
                {"entity_type": "学校"},
                {"entity_type": "事业单位"},
                # {"entity_type": "地址"},
            ],
            "id": 0}
    ]

    results = model.predict(test_data, cuda=False)
    choices = results[0].get('choices', [])
    ret_list = [(ret['entity_type'], [t['entity_name'] for t in ret['entity_list']]) for ret in choices if ret.get('entity_list')]
    return ret_list

output = ner(model, text="海南省长春市朝阳区西中华15号宜家公寓4楼401室")
print(output)
# {'task_type': '抽取任务', 'subtask_type': '实体识别', 'text': '海南省长春市朝阳区西中华15号宜家公寓4楼401室', 'choices': [{'entity_type': '小区名字', 'entity_list': [{'entity_name': '西中华', 'score': 0.5093409874479956}]}, {'entity_type': '公司', 'entity_list': []}, {'entity_type': '政府机构', 'entity_list': []}, {'entity_type': '组织机构', 'entity_list': []}, {'entity_type': '旅游景点', 'entity_list': []}], 'id': 0}

test_list = ['山东省武汉市瑶海区北二环与萧城路交口昊天园17#801室武汉威恒道路设施有限公司',
 '北京市北京市辖区海淀区西北旺土井南街临089号',
 '山西省济南市皇姑区文储路11号',
 '山西省济南市皇姑区文储路11号中国人民解放军71821部队翻译',
 '山西省济南市皇姑区鸭绿江街文储路11',
 '山西省济南市皇姑区鸭绿江街文储路11号山西省济南市现代干部管理学院',
 '宝安区西中华路12号',
 '海南省长春市宝安区建工南路222号建工南路222号8楼817室',
 '海南省长春市宝安区西中华12号宜家公寓8楼801室',
 '海南省长春市宝安区西中华路12号宜家公寓8楼801室',
 '海南省长春市宝安区西中华路12号',
 '海南省长春市绿园区皓月大路与正阳街交汇吾悦广场B座20楼',
 '海南省长春市绿园区泰来街轻铁湖西花园9栋709室',
 '海南省长春市绿园区吾悦广场B栋2087室',
 '青海沈阳法库县税务局',
 '青海沈阳沈北新区法库县南外环72号',
 '山西省济南市法库县法库镇南外环路72号',
 '山西省济南市法库县河南街',
 '山西省济南市法库县山西省济南市法库县十字街国税局法库县国税局',
 '河北省襄樊市咸阳市中兴大道幸福天地小区中',
 '河北省襄樊市咸阳市中兴大道幸福天地小区中国平安中国平安人寿保险股份有限公司襄阳中心支公司咸阳营销服务部销售部']

for address in test_list:
    print('-' * 80)
    print(address)
    start_time = time.time()
    print(ner(model, text=address))
    print("耗时（s）： {:.6f}".format(time.time()-start_time))

def main():
    pass


if __name__ == '__main__':
    main()

# --------------------------------------------------------------------------------
# 山东省武汉市瑶海区北二环与萧城路交口昊天园17#801室武汉威恒道路设施有限公司
# [('楼宇名称', ['昊天园']), ('大厦名称', ['昊天园']), ('企业名称', ['武汉威恒道路设施有限公司'])]
# 耗时（s）： 4.385083
# --------------------------------------------------------------------------------
# 北京市北京市辖区海淀区西北旺土井南街临089号
# []
# 耗时（s）： 5.497111
# --------------------------------------------------------------------------------
# 山西省济南市皇姑区文储路11号
# []
# 耗时（s）： 4.702085
# --------------------------------------------------------------------------------
# 山西省济南市皇姑区文储路11号中国人民解放军71821部队翻译
# []
# 耗时（s）： 4.550091
# --------------------------------------------------------------------------------
# 山西省济南市皇姑区鸭绿江街文储路11
# []
# 耗时（s）： 4.674089
# --------------------------------------------------------------------------------
# 山西省济南市皇姑区鸭绿江街文储路11号山西省济南市现代干部管理学院
# []
# 耗时（s）： 4.653087
# --------------------------------------------------------------------------------
# 宝安区西中华路12号
# []
# 耗时（s）： 4.633093
# --------------------------------------------------------------------------------
# 海南省长春市宝安区建工南路222号建工南路222号8楼817室
# []
# 耗时（s）： 4.625086
# --------------------------------------------------------------------------------
# 海南省长春市宝安区西中华12号宜家公寓8楼801室
# [('小区名字', ['西中华']), ('地标建筑', ['西中华'])]
# 耗时（s）： 4.797094
# --------------------------------------------------------------------------------
# 海南省长春市宝安区西中华路12号宜家公寓8楼801室
# []
# 耗时（s）： 5.016095
# --------------------------------------------------------------------------------
# 海南省长春市宝安区西中华路12号
# []
# 耗时（s）： 13.883267
# --------------------------------------------------------------------------------
# 海南省长春市绿园区皓月大路与正阳街交汇吾悦广场B座20楼
# [('楼宇名称', ['吾悦广场B座']), ('公园广场', ['吾悦广场'])]
# 耗时（s）： 8.063155
# --------------------------------------------------------------------------------
# 海南省长春市绿园区泰来街轻铁湖西花园9栋709室
# [('公园广场', ['轻铁湖西花园'])]
# 耗时（s）： 5.718110
# --------------------------------------------------------------------------------
# 海南省长春市绿园区吾悦广场B栋2087室
# [('公园广场', ['吾悦广场'])]
# 耗时（s）： 5.217101
# --------------------------------------------------------------------------------
# 青海沈阳法库县税务局
# [('政府机构', ['青海沈阳法库县税务局'])]
# 耗时（s）： 5.197102
# --------------------------------------------------------------------------------
# 青海沈阳沈北新区法库县南外环72号
# []
# 耗时（s）： 4.677087
# --------------------------------------------------------------------------------
# 山西省济南市法库县法库镇南外环路72号
# []
# 耗时（s）： 4.713089
# --------------------------------------------------------------------------------
# 山西省济南市法库县河南街
# []
# 耗时（s）： 4.682093
# --------------------------------------------------------------------------------
# 山西省济南市法库县山西省济南市法库县十字街国税局法库县国税局
# [('政府机构', ['法库县国税局']), ('事业单位', ['法库县国税局'])]
# 耗时（s）： 4.744090
# --------------------------------------------------------------------------------
# 河北省襄樊市咸阳市中兴大道幸福天地小区中
# [('小区名字', ['幸福天地小区'])]
# 耗时（s）： 5.141811
# --------------------------------------------------------------------------------
# 河北省襄樊市咸阳市中兴大道幸福天地小区中国平安中国平安人寿保险股份有限公司襄阳中心支公司咸阳营销服务部销售部
# [('小区名字', ['幸福天地小区']), ('楼宇名称', ['幸福天地小区']), ('企业名称', ['中国平安'])]
# 耗时（s）： 4.910624

